<template>
    <v-container>
        <div class="text-h3 py-6 mx-10 text-left">Руководство пользователя</div>

        <v-btn  variant="outlined" class="mx-10" :to="{name: 'Home'}">
            <v-icon icon="mdi-arrow-collapse-left" color="purple-darken-4" class="mr-2"></v-icon>назад
        </v-btn>

        <v-container>
            <v-card>
                <v-toolbar
                    color="purple-darken-4"
                >
                    <v-toolbar-title>Разделы меню</v-toolbar-title>
                </v-toolbar>
                <div class="d-flex flex-row">
                <v-tabs
                    v-model="tab"
                    direction="vertical"
                    color="purple-darken-4"
                >
                    <v-tab value="option-1">
                        Маршруты
                    </v-tab>

                    <v-tab value="option-2">
                        Добавить маршрут
                    </v-tab>

                    <v-tab value="option-3">
                        Область построения 
                    </v-tab>

                    <v-tab value="option-4">
                        Информация о маршруте
                    </v-tab>

                    <v-tab value="option-5">
                        История маршрута
                    </v-tab>
                    <v-tab value="option-6">
                        Аккаунт
                    </v-tab>
                </v-tabs>
                <v-window v-model="tab">
                    <v-window-item value="option-1">
                        <v-card flat>
                            <v-card-text>
                                <v-container>
                                    <div class="text-h4 mb-5 text-left">Выбор пункта "Маршруты"</div>
                                    <div class="mb-5">В меню пользователь должен нажать на кнопку <b>"Маршруты"</b> (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/выбор меню маршрута.jpg"
                                    >
                                    </v-img>
                                    <div class="text-h4 mt-15 mb-5 text-left">Страница "Маршруты"</div>

                                    <div class="mb-5">После выбора пункта в меню пользователь окажется на странице "Маршруты" (как выглядит страница "Маршруты" изображено на ниже предсталенном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/про маршруты 2.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Возвращение обратно в меню</div>
                                    <div class="mb-5">Для перехода обратно в меню пользователь должен нажать на кнопку <b>"НАЗАД"</b> (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/про маршруты кнопка назад.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Переход на страницу "Добавить маршрут"</div>
                                    <div class="mb-5">Для перехода на страницу <b>"Добавить маршрут"</b> пользователь должен нажать на кнопку <b>"Добавить маршрут"</b> (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/про маршруты кнопка добавить маршрут.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Переход на страницу "Информация о конкретном маршруте"</div>
                                    <div class="mb-5">Для перехода на страницу о конкретном маршруте пользователь должен навеститсь на блок с краткой информацией о маршруте, выбранный блок подсветится фиолетовым цветом и ползовотель должен нажать на блок (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/Выбрать конкретный маршрут.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Удалить уже созданный маршрут</div>
                                    <div class="mb-5">Для того, чтобы удалить конкретный маршрут, пользователю необходимо нажать на кнопку <b>"УДАЛИТЬ"</b>, которая находится под каждым маршрутом (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/про маршруты кнопка удалить.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Статусы маршрутов</div>

                                    <v-row class="mt-5 ml-2">
                                        <v-card color="teal-accent-4" class="text-h5 px-10 py-2">в процессе</v-card> <span class="text-h6 ml-2 mt-2">- статус показывающий, что в данном маршруте есть промежуточные маршруты, но они еще не достигают финальную точку.</span>
                                    </v-row>

                                    <v-row class="mt-10 ml-2">
                                        <v-card color="orange-accent-4" class="text-h5 px-10 py-2">завершение</v-card> <span class="text-h6 ml-2 mt-2">- статус показывающий, что построены все промежуточные маршруты, но не стоит дата завершения маршрута.</span>
                                    </v-row>

                                    <v-row class="mt-10 ml-2">
                                        <v-card color="blue-grey" class="text-h5 px-10 py-2">завершён</v-card> <span class="text-h6 ml-2 mt-2">- статус показывающий, что построены все промежуточные маршруты и установлены все даты.</span>
                                    </v-row>
                                    
                                    
                                    

                                </v-container>
                                
                            </v-card-text>
                        </v-card>
                    </v-window-item>
                <v-window-item value="option-2">
                    <v-card flat>
                        <v-card-text>
                            <v-container>
                                    <div class="text-h4 mb-5 text-left">Введите имя судна</div>
                                    <div class="mb-5">Пользователь должен в поле <b>Название судна</b> ввести название судна (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут название судна.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Подробно о каждом ледовом классе</div>
                                    <div class="mb-5">Пользователь может назвать на кнопку <b>Подробно</b> и ему будет представлена краткая информация о ледовом классе. При нажатии кнопки <b>Подробно</b> краткая информация закроется (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршруты подробно.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Выбор ледового класса судна</div>
                                    <div class="mb-5">Пользователь должен выбрать один ледовый класс судна нажав на кнопку напротив название ледового класса судна(выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут выбор ледовго класса.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Переход на следующий шаг</div>
                                    <div class="mb-5">После выше описанных действий пользользователь должен нажать на кнопку <b>СЛЕДУЮЩИЙ ШАГ</b>(выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/Добавить маршрут 1-ей следущий шаг.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Выбор ледовой обстановки (Случайным образом)</div>
                                    <div class="mb-5">После выше описанных действий пользователь окажется на втором шаге добавления маршрута, на карте уже будет отображена ледовая обстановка за сегоднешний день, но если пользовтаель хочет сформировать случайную ледовую обстановку, то он может нажать на кнопку <b>СГЕНЕРИРОВАТЬ ЛЕДОВУЮ ОБСТАНОВКУ</b>(выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут лед случайный.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Загрузить ледовую обстановку (фаилы формата JSON)</div>
                                    <div class="my-5">Так как на интерактивной карте лёд изображен при помощи полигонов, пример синтаксиса (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="600"
                                        src="../assets/photo_for_manul/пример полигона в geojson.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">Пользовтаель также может сформировать ледовую обстановку на основе файлов структуры geoJSON, нажав на кнопку <b>ЗАГРУЗИТЬ ЛЕДОВУЮ ОБСТАНОВКУ</b>(выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/Добавить маршрут загрузить ледовую обстановку из JSON.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">После нажатия на кнопку <b>ЗАГРУЗИТЬ ЛЕДОВУЮ ОБСТАНОВКУ</b> пользователю будет выведена форма для загрзки льда (выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/Добавить маршрут форма для загрузки ледовой обстановки.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">Чтобы загрузить фаил формата JSON с ледовой обстановкой, необходимо нажать на форму с название льда, который вы хотите загрузить(выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут прикрепить фаил.jpg"
                                    >
                                    </v-img>
                                    <div class="my-5">При нажатии на форму появится проводник и пользователю необходимо выбрать фаил с ледовой обстановкой и нажать кнопку <b>открыть</b>(выделено красным цветом на ниже представленном скриншоте)</div>
                                    <v-img
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут имя фаила.jpg"
                                    >
                                    </v-img>
                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/Добавить маршрут кнопка открыть.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">После прикрепления всех файлов с ледовой обстановкой, пользователю необходимо нажать кнопку <b>ЗАГРУЗИТЬ</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/Добавить маршрут кнопка загрузить.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Загрузить фотографию ледовую обстановку</div>
                                    <div class="my-5">Пользовтаель также может сформировать ледовую обстановку на основе файлов структуры geoJSON, нажав на кнопку <b>ЗАГРУЗИТЬ ФОТО ЛЕДОВОЙ ОБСТАНОВКИ</b>(выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут загрузить фото ледовойо обстановки.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">После нажатия на кнопку <b>ЗАГРУЗИТЬ ФОТО ЛЕДОВОЙ ОБСТАНОВКИ</b> пользователю будет выведена форма для загрзки фото (выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить лед форма заполнения.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">При нажатии на форму появится проводник и пользователю необходимо выбрать фаил формата png с ледовой обстановкой и нажать кнопку открыть(выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить фото льда имя фаила.jpg"
                                    >
                                    </v-img>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить фото льда открыть.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">После прикрепления файла фото с ледовой обстановкой, пользователю необходимо нажать кнопку ЗАГРУЗИТЬ (выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить фото льда нажать на кнопку загрузить.jpg"
                                    >
                                    </v-img>

                                    <div class="text-h4 mt-15 mb-5 text-left">Выбор исходного пункта и пункта назначения</div>

                                    <div class="my-5">Всю манипулирование координатами исходного пункта и пунтка назначения происходит через блок (выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут блок манипулирования.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">Ввести координаты можно вручную это значит, что необходимо заполнить поля долготы и широты для исходного пункта и для пунукта назначения (выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут формы для долготы и широты.jpg"
                                    >
                                    </v-img>

                                    <div class="my-5">Либо указать на интерактивной карте, для этого необходимо в поле (выделено красным цветом на ниже представленном скриншоте) выбрать <b>Исходный пункт</b> или <b>Пункт назначения</b> какая точка выбраная, координатый той точки вы можете изменять при клике на карту</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут выбор за какую точку передвигаться по карте.jpg"
                                    >
                                    </v-img>
                                    
                                    <div class="text-h4 mt-15 mb-5 text-left">Переход на следующий шаг</div>
                                    <div class="my-5">Пользователю необходимо нажать на кнопку <b>СЛЕДУЮЩИЙ ШАГ</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                                    <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/добавить маршрут 3-ий шаг.jpg"
                                    >
                                    </v-img>


                                    
                            </v-container>
                        </v-card-text>
                    </v-card>
                </v-window-item>

                <v-window-item  value="option-3">
                    <v-card flat >
                        <v-card-text>
                            <div class="text-h4 mb-5 text-left">Область построения</div>
                            <div class="my-5">Маршруты в данном программном средстве строятся в <b>области построения</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/область построения сама область.jpg"
                                    >
                            </v-img>

                            <div class="my-5">Панель манипулирования <b>областью построения</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/область построения манипулирования областью.jpg"
                                    >
                            </v-img>


                            <div class="text-h4 mt-15 mb-5 text-left">Как взаимодействовать областью построения</div>
                            <div class="my-5">При нажатии на <b>плюс</b> в <b>Левая сторона квадрата</b> двигает выделенную сторону квадрата <b>в лево</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/левая сторона квадрата плюс.jpg"
                                    >
                            </v-img>

                            <div class="my-5">При нажатии на <b>минус</b> в <b>Левая сторона квадрата</b> двигает выделенную сторону квадрата <b>в право</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/левая сторона квадрата право.jpg"
                                    >
                            </v-img>

                            <div class="my-5">При нажатии на <b>плюс</b> в <b>Правая сторона квадрата</b> двигает выделенную сторону квадрата <b>в право</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/правая сторона квадрата плюс.jpg"
                                    >
                            </v-img>

                            <div class="my-5">При нажатии на <b>минус</b> в <b>Правая сторона квадрата</b> двигает выделенную сторону квадрата <b>в лево</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/правая сторона минус.jpg"
                                    >
                            </v-img>

                            <div class="my-5">При нажатии на <b>плюс</b> в <b>Верхняя сторона квадрата</b> двигает выделенную сторону квадрата <b>в верх</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/верхняя сторона плюс.jpg"
                                    >
                            </v-img>

                            <div class="my-5">При нажатии на <b>минус</b> в <b>Верхняя сторона квадрата</b> двигает выделенную сторону квадрата <b>вниз</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/верхня строна минус.jpg"
                                    >
                            </v-img>

                            <div class="my-5">При нажатии на <b>плюс</b> в <b>Нижняя сторона квадрата</b> двигает выделенную сторону квадрата <b>вниз</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/нижняя сторона плюс.jpg"
                                    >
                            </v-img>

                            <div class="my-5">При нажатии на <b>минус</b> в <b>Нижняя сторона квадрата</b> двигает выделенную сторону квадрата <b>в верх</b> (выделено красным цветом на ниже представленном скриншоте)</div>

                            <v-img class="mt-5"
                                        :width="1000"
                                        src="../assets/photo_for_manul/нижняя сторона минус.jpg"
                                    >
                            </v-img>
                        </v-card-text>
                    </v-card>
                </v-window-item>

                <v-window-item  value="option-4">
                    <v-card flat >
                        <v-card-text>

                        </v-card-text>
                    </v-card>
                </v-window-item>
                </v-window>
            </div>
            </v-card>
        </v-container>
    </v-container>
</template>

<script>
  export default {
    data: () => ({
      tab: 'option-1',
    }),
  }
</script>